WITH max_mark_1101 AS (
    SELECT MAX(Н_ВЕДОМОСТИ.ОЦЕНКА::Integer) as max_mark FROM Н_ВЕДОМОСТИ
    JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_УЧЕНИКИ.ГРУППА = '1101' 
    AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('5', '4', '3', '2')
)

SELECT Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО, AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::Integer) as avg_mark FROM Н_УЧЕНИКИ
JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('5', '4', '3', '2')
AND Н_ВЕДОМОСТИ.ОЦЕНКА::Integer <= (SELECT max_mark FROM max_mark_1101)
GROUP BY Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
ORDER BY avg_mark DESC;

